<div class="checkout-categories-item js-checkout-category closed" data-category="payment">
    <div class="checkout-categories-item-head js-checkout-head">
        <div class="checkout-categories-item-head__title">
            <?= $number;
            $number++ ?>.Выберите тип оплаты
        </div>
        <i class="far fa-check-circle check-ok"></i>
        <!--        <div class="checkout-categories-item-head__arrow">-->
        <!---->
        <!--        </div>-->
    </div>
    <div class="checkout-categories-item-body">
        <? if ($arResult['AGE_18']) : ?>
            <div class="checkout-categories-item-body-about-time-comment" style="margin: 15px 0">
                <div class="checkout-categories-item-body-about-time-comment__icon">
                    <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="26px" height="27px">
                        <path fill-rule="evenodd" fill="rgb(222, 45, 66)" d="M23.989,20.710 L25.636,26.309 L19.996,24.722 C17.976,26.014 15.575,26.763 13.000,26.763 C5.820,26.763 -0.000,20.943 -0.000,13.763 C-0.000,6.584 5.820,0.763 13.000,0.763 C20.180,0.763 26.000,6.584 26.000,13.763 C26.000,16.318 25.262,18.700 23.989,20.710 Z"></path>
                        <path fill-rule="evenodd" fill="rgb(255, 255, 255)" d="M15.000,6.763 L14.091,16.854 L14.086,16.854 C14.033,17.326 13.578,17.672 13.091,17.672 C12.604,17.672 12.148,17.326 12.096,16.854 L12.091,16.854 L11.182,6.763 L11.184,6.763 C11.183,6.733 11.182,6.703 11.182,6.672 C11.182,5.651 12.069,4.797 13.091,4.797 C14.112,4.797 15.000,5.651 15.000,6.672 C15.000,6.703 14.999,6.733 14.997,6.763 L15.000,6.763 ZM13.091,18.672 C13.995,18.672 14.727,19.405 14.727,20.309 C14.727,21.212 13.995,21.945 13.091,21.945 C12.187,21.945 11.454,21.212 11.454,20.309 C11.454,19.405 12.187,18.672 13.091,18.672 Z"></path>
                    </svg>
                </div>
                <div class="checkout-categories-item-body-about-time-comment__text">
                    <span class="mod-red">ВНИМАНИЕ!</span>Онлайн оплата на сайте недоступна для некоторых категорий
                    товара, такие как: сигареты,
                    табакосодержащие изделия и энергетические напитки.
                </div>

            </div>
        <? endif; ?>
        <div class="checkout-categories-item-body-row">
            <?
//print_var($arResult["PAY_SYSTEM"], $USER->IsAdmin());
            foreach ($arResult["PAY_SYSTEM"] as $arPaySystem) {
	            if($_COOKIE['DELIVERY'] == 'PICKUP' && in_array($arPaySystem['ID'], CSiteUtils::$onlinePayments)) continue;

	           // if($_COOKIE['DELIVERY'] == 'PICKUP' && $arPaySystem['ID'] == 13) continue;



	            if (!in_array($arPaySystem['ID'], $arResult['PAY_REST']) && $_COOKIE['DELIVERY'] != 'PICKUP')
                    continue;



//                if (!$USER->IsAdmin() && in_array($arPaySystem['ID'], CSiteUtils::$onlinePayments))
//                    continue;

                if ($_COOKIE['DELIVERY'] != 'PICKUP' &&  CSiteUtils::$onlinePayment == $arPaySystem['ID'])
                    continue;

//                if ($_COOKIE['DELIVERY'] == 'PICKUP' &&  CSiteUtils::$onlinePayment != $arPaySystem['ID'])
//                    continue;


                if (!$USER->IsAdmin() && $arPaySystem['ID'] == 24)
                    continue;

                if (!$USER->IsAdmin() && $arPaySystem['ID'] == 14)
                    continue;

                if (!$USER->IsAdmin() && $arPaySystem['ID'] == 15)
                    continue;

                //               if ((!$USER->IsAdmin() && $USER->GetID() != 45673 && $_COOKIE['BITRIX_TT'] != 'ТТ-55') && $arPaySystem['ID'] == CSiteUtils::$onlinePayment)
                //                    continue;

                if ($_COOKIE['DELIVERY'] != 'PICKUP' && (!$USER->IsAdmin() && $_COOKIE['BITRIX_TT'] != 'ТТ-103' && $_COOKIE['BITRIX_TT'] != 'ТТ-55'
                    && $_COOKIE['BITRIX_TT'] != 'ТТ-41' && $_COOKIE['BITRIX_TT'] != 'ТТ-90' && $_COOKIE['BITRIX_TT'] != 'ТТ-104'
                    && $_COOKIE['BITRIX_TT'] != 'ТТ-47' && $_COOKIE['BITRIX_TT'] != 'ТТ-89') && in_array($arPaySystem['ID'], CSiteUtils::$onlinePayments))
                    continue;


                if ($arPaySystem['ID'] == CSiteUtils::$onlinePayment || in_array($arPaySystem['ID'], CSiteUtils::$onlinePayments)) {
                    $arPaySystem['PSA_NAME'] = 'Онлайн оплата на сайте';
                }
                if ($arPaySystem['ID'] == 24)
                    $arPaySystem['PSA_NAME'] = 'Онлайн оплата на сайте TEST';

	            if($_COOKIE['DELIVERY'] == 'PICKUP' && $arPaySystem['ID'] == 1) {
		            $arPaySystem['PSA_NAME'] = 'Оплата наличными';
	            }

	            if($_COOKIE['DELIVERY'] == 'PICKUP' && $arPaySystem['ID'] == 2) {
		            $arPaySystem['PSA_NAME'] = 'Банковской картой в пункте выдачи';
                }


                $disabled = false;
                if ($arResult['AGE_18'] && $arPaySystem['ID'] == 16) {
                    $disabled = true;
                }
            ?>
                <label class="checkout-categories-item-body-option">
                    <input type="radio" id="ID_PAY_SYSTEM_ID_<?= $arPaySystem["ID"] ?>" name="PAY_SYSTEM_ID" value="<?= $arPaySystem["ID"] ?>" <? if ($arPaySystem["CHECKED"] == "Y")
                                                                                                                                                    echo " checked=\"checked\""; ?> <?= $disabled ? 'disabled' : '' ?>>
                    <div class="checkout-categories-item-body-option-wrapper">
                        <? if ($arPaySystem['ID'] == 1) : ?>
                            <div class="checkout-categories-item-body-option__icon">
                                <svg version="1.1" id="Слой_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 487 487" style="enable-background:new 0 0 487 487;" xml:space="preserve">
                                    <path d="M133.4,222.2c0,64,51.9,115.8,115.8,115.8S365,286.1,365,222.2s-51.9-115.8-115.8-115.8
                                                        C185.3,106.4,133.4,158.2,133.4,222.2z M249.2,122.3c55.2,0,99.9,44.7,99.9,99.9S304.3,322,249.2,322s-99.9-44.7-99.9-99.9
                                                        C149.4,167,194.1,122.4,249.2,122.3z" />
                                    <path d="M404.4,357.7l-62.6,29.6c-8.6-16.1-25.2-26.3-43.5-26.8l-57.8-1.6c-9.1-0.3-18.1-2.6-26.3-6.8l-5.9-3
                                                        c-30.1-15.7-66-15.6-96,0.1l0.4-13.3c0.1-4.4-3.4-8.1-7.8-8.2l-63.3-1.7c-4.4-0.1-8.1,3.4-8.2,7.8l-3.8,139
                                                        c-0.1,4.4,3.4,8.1,7.8,8.2l63.3,1.7h0.2c4.3,0,7.9-3.4,8-7.8l0.2-6.7l16.5-8.8c6.5-3.5,14-4.3,21.1-2.3l98.3,27.6
                                                        c0.2,0.1,0.3,0.1,0.5,0.1c7.1,1.5,14.3,2.2,21.6,2.2c15.4,0,30.6-3.3,44.5-9.7c0.3-0.2,0.7-0.3,1-0.5l142.5-92.2
                                                        c3.5-2.3,4.7-7,2.6-10.6C447.1,355.2,423.7,348,404.4,357.7z M45.9,465.1l3.4-123l47.4,1.3l-3.4,123L45.9,465.1z M304.4,463
                                                        c-17.4,7.8-36.7,10-55.4,6.2l-98-27.5c-11-3.1-22.8-1.8-32.9,3.6l-8.4,4.5l2.3-81.8c26.6-17.7,60.8-19.5,89.2-4.8l5.9,3
                                                        c10.3,5.3,21.6,8.2,33.2,8.6l57.8,1.6c16.2,0.5,30,12,33.3,27.9l-86-2.4c-4.4-0.1-8.1,3.4-8.2,7.8c-0.1,4.4,3.4,8.1,7.8,8.2l95,2.6
                                                        h0.2c4.3,0,7.9-3.4,8-7.8c0.1-3.5-0.2-6.9-0.8-10.4l64.2-30.3c0.1,0,0.1-0.1,0.2-0.1c9.1-4.6,20.1-3.1,27.6,3.9L304.4,463z" />
                                    <path d="M257.2,83.9V8c0-4.4-3.6-8-8-8s-8,3.6-8,8v75.9c0,4.4,3.6,8,8,8S257.2,88.3,257.2,83.9z" />
                                    <path d="M317.1,83.9V47.9c0-4.4-3.6-8-8-8c-4.4,0-8,3.6-8,8v35.9c0,4.4,3.6,8,8,8C313.5,91.9,317.1,88.3,317.1,83.9z" />
                                    <path d="M197.3,83.9V47.9c0-4.4-3.6-8-8-8s-8,3.6-8,8v35.9c0,4.4,3.6,8,8,8S197.3,88.3,197.3,83.9z" />
                                    <g>
                                        <g>
                                            <path d="M202.1,264.7h20v17.1c0,0.8,0.3,1.5,0.8,2.1c0.5,0.5,1.2,0.8,2.1,0.8h14.9c0.8,0,1.4-0.3,2-0.8c0.6-0.5,0.8-1.2,0.8-2.1
                                                                v-17.1h45.1c0.8,0,1.5-0.3,2.1-0.8c0.5-0.5,0.8-1.2,0.8-2.1v-11.4c0-0.8-0.3-1.5-0.8-2.1c-0.5-0.5-1.2-0.8-2.1-0.8h-45.1V237h30.4
                                                                c11.9,0,21.6-3.6,29.1-10.9c7.5-7.3,11.3-16.6,11.3-28.1c0-11.5-3.8-20.9-11.3-28.1c-7.5-7.3-17.2-10.9-29.1-10.9H225
                                                                c-0.8,0-1.5,0.3-2.1,0.8c-0.5,0.5-0.8,1.2-0.8,2.1V218h-20c-0.8,0-1.5,0.3-2.1,0.8c-0.5,0.6-0.8,1.2-0.8,2v13.3
                                                                c0,0.8,0.3,1.5,0.8,2.1c0.5,0.5,1.2,0.8,2.1,0.8h20v10.5h-20c-0.8,0-1.5,0.3-2.1,0.8c-0.5,0.5-0.8,1.2-0.8,2.1v11.4
                                                                c0,0.8,0.3,1.5,0.8,2.1C200.6,264.4,201.3,264.7,202.1,264.7z M242.7,178h28.6c6.3,0,11.4,1.8,15.3,5.5c3.9,3.7,5.8,8.5,5.8,14.5
                                                                c0,6-1.9,10.8-5.8,14.5c-3.9,3.7-9,5.5-15.3,5.5h-28.6V178z" />
                                        </g>
                                    </g>
                                </svg>
                            </div>
                            <div class="checkout-categories-item-body-option__icon-hover">
                                <svg version="1.1" id="Слой_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 471 471" style="enable-background:new 0 0 471 471;" xml:space="preserve">
                                    <path d="M403.9,370.1c-0.1,0-0.1,0.1-0.2,0.1l-64.9,30.7c0.7,3.6,1,7.2,0.9,10.9c-0.1,3.8-3.2,6.8-7,6.8c-0.1,0-0.1,0-0.2,0l-95-2.6
                                                        c-3.9-0.1-6.9-3.3-6.8-7.2c0.1-3.9,3.3-6.9,7.2-6.8l87.3,2.4c-2.9-16.9-17.3-29.4-34.5-29.9l-57.8-1.6c-11.4-0.3-22.6-3.2-32.7-8.5
                                                        l-5.9-3c-28.9-15-63.6-13.1-90.6,5.1l-2.3,84l9.9-5.3c9.9-5.3,21.4-6.6,32.2-3.5l98,27.5c18.9,3.9,38.5,1.7,56.1-6.3L433.5,375
                                                        C425.8,367.1,413.8,365.1,403.9,370.1z" />
                                    <path d="M37.7,465.1l3.4-125l49.4,1.4l-3.4,125L37.7,465.1z" />
                                    <path d="M248.6,82.9V7c0-3.9-3.1-7-7-7c-3.9,0-7,3.1-7,7v75.9c0,3.9,3.1,7,7,7C245.4,89.9,248.6,86.7,248.6,82.9z" />
                                    <path d="M308.5,82.9V46.9c0-3.9-3.1-7-7-7c-3.9,0-7,3.1-7,7v35.9c0,3.9,3.1,7,7,7C305.3,89.9,308.5,86.7,308.5,82.9z" />
                                    <path d="M188.7,82.9V46.9c0-3.9-3.1-7-7-7c-3.9,0-7,3.1-7,7v35.9c0,3.9,3.1,7,7,7C185.5,89.9,188.7,86.7,188.7,82.9z" />
                                    <g>
                                        <path d="M263.6,177.1h-28.7v40.2h28.7c6.3,0,11.5-1.9,15.3-5.6c3.9-3.7,5.8-8.6,5.8-14.5c0-6-1.9-10.8-5.8-14.5
                                                            C275,179,269.9,177.1,263.6,177.1z" />
                                        <path d="M242,120.3c-55.7,0.1-100.8,45.2-100.9,100.9c0,55.7,45.2,100.9,100.9,100.9s100.9-45.2,100.9-100.9
                                                            C342.9,165.5,297.7,120.3,242,120.3z M294.7,225.5c-7.6,7.3-17.3,10.9-29.3,10.9h-30.5V247h45.3c0.8,0,1.5,0.3,2.1,0.8
                                                            c0.5,0.5,0.8,1.2,0.8,2.1v11.5c0,0.8-0.3,1.5-0.8,2.1c-0.5,0.5-1.2,0.8-2.1,0.8h-45.3v17.2c0,0.8-0.3,1.5-0.9,2.1
                                                            c-0.6,0.5-1.2,0.8-2,0.8h-15c-0.8,0-1.5-0.3-2.1-0.8c-0.5-0.5-0.8-1.2-0.8-2.1v-17.2H194c-0.8,0-1.5-0.3-2.1-0.8
                                                            c-0.5-0.5-0.8-1.2-0.8-2.1v-11.5c0-0.8,0.3-1.5,0.8-2.1c0.5-0.5,1.2-0.8,2.1-0.8h20.1v-10.6H194c-0.8,0-1.5-0.3-2.1-0.8
                                                            c-0.5-0.5-0.8-1.2-0.8-2.1v-13.4c0-0.8,0.3-1.5,0.8-2c0.5-0.6,1.2-0.9,2.1-0.9h20.1v-56.5c0-0.8,0.3-1.5,0.8-2.1
                                                            c0.5-0.5,1.2-0.8,2.1-0.8h48.4c12,0,21.7,3.7,29.3,10.9c7.6,7.3,11.4,16.7,11.4,28.3C306,208.8,302.2,218.2,294.7,225.5z" />
                                    </g>
                                </svg>
                            </div>
                        <? elseif ($arPaySystem['ID'] == 2 || $arPaySystem['ID'] == 16 || in_array($arPaySystem['ID'], CSiteUtils::$onlinePayments)) : ?>
                            <div class="checkout-categories-item-body-option__icon">
                                <svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <g>
                                                <path d="M469.334,170.671h-5.926l-73.272-127.99c-5.677-9.896-14.844-16.969-25.813-19.906
                                                                    c-4.078-1.089-8.225-1.558-12.331-1.422c-6.885,0.229-13.652,2.161-19.773,5.724L21.157,208.171
                                                                    C7.546,216.092-0.063,230.539,0,245.339c0.03,7.152,1.865,14.387,5.656,21.009L64,368.257v79.747
                                                                    c0,23.531,19.135,42.667,42.667,42.667h362.667c23.531,0,42.667-19.135,42.667-42.667V213.337
                                                                    C512,189.806,492.865,170.671,469.334,170.671z M64,325.302l-8.147-14.232L64,306.327V325.302z M64,281.643l-18.747,10.914
                                                                    l-10.531-18.396L64,257.117V281.643z M64,213.337v19.096l-39.858,23.203c-5.762-10.172-2.306-23.173,7.743-29.029l32.698-19.035
                                                                    C64.323,209.477,64,211.363,64,213.337z M438.817,170.671H296.998l106.366-61.928L438.817,170.671z M392.765,90.229
                                                                    l-138.163,80.441h-42.124l169.758-98.833L392.765,90.229z M342.959,45.514c4.833-2.813,10.458-3.594,15.844-2.135
                                                                    c5.448,1.458,9.99,4.979,12.813,9.906l0.022,0.039L170.081,170.671h-42.109L342.959,45.514z M490.667,448.004
                                                                    c0,11.76-9.573,21.333-21.333,21.333H106.667c-11.76,0-21.333-9.573-21.333-21.333V213.337c0-11.76,9.573-21.333,21.333-21.333
                                                                    h362.667c11.76,0,21.333,9.573,21.333,21.333V448.004z" />
                                                <path d="M404,341.337c-7,0-13.802,1.625-20,4.75c-6.198-3.125-13-4.75-20-4.75c-24.26,0-44,19.135-44,42.667
                                                                    s19.74,42.667,44,42.667c7,0,13.802-1.625,20-4.75c6.198,3.125,13,4.75,20,4.75c24.26,0,44-19.135,44-42.667
                                                                    S428.261,341.337,404,341.337z M404,405.337c-4.927,0-9.667-1.563-13.74-4.51c-1.865-1.354-4.063-2.031-6.26-2.031
                                                                    c-2.198,0-4.396,0.677-6.26,2.031c-4.073,2.948-8.813,4.51-13.74,4.51c-12.5,0-22.667-9.573-22.667-21.333
                                                                    S351.5,362.671,364,362.671c4.927,0,9.667,1.563,13.74,4.51c3.729,2.708,8.792,2.708,12.521,0c4.073-2.948,8.813-4.51,13.74-4.51
                                                                    c12.5,0,22.667,9.573,22.667,21.333S416.5,405.337,404,405.337z" />
                                                <path d="M138.667,362.671h106.667c5.896,0,10.667-4.771,10.667-10.667s-4.771-10.667-10.667-10.667H138.667
                                                                    c-5.896,0-10.667,4.771-10.667,10.667S132.771,362.671,138.667,362.671z" />
                                                <path d="M288,405.337H138.667c-5.896,0-10.667,4.771-10.667,10.667s4.771,10.667,10.667,10.667H288
                                                                    c5.896,0,10.667-4.771,10.667-10.667S293.896,405.337,288,405.337z" />
                                            </g>
                                        </g>
                                    </g>
                                </svg>
                            </div>
                            <div class="checkout-categories-item-body-option__icon-hover">
                                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <path d="M469.331,170.67h-5.91l-73.277-127.99c-5.677-9.896-14.845-16.969-25.814-19.906c-10.917-2.917-22.335-1.385-32.106,4.302
                                                                L21.141,208.17C0.953,219.92-5.996,246.025,5.64,266.347l5.278,9.219l0.004,0.01l8.82,15.398L64,368.256v79.747
                                                                c0,23.531,19.137,42.667,42.669,42.667h362.661c23.533,0,42.669-19.135,42.669-42.667V213.337
                                                                C512,189.806,492.863,170.67,469.331,170.67z M64.002,325.302l-8.147-14.232l8.147-4.743V325.302z M64.002,213.337v19.096
                                                                l-39.859,23.203c-5.762-10.172-2.306-23.173,7.744-29.029l32.699-19.035C64.325,209.476,64.002,211.363,64.002,213.337z
                                                                M403.376,108.742l35.454,61.928H297.007L403.376,108.742z M342.969,45.514c4.833-2.813,10.459-3.594,15.844-2.135
                                                                c5.448,1.458,9.99,4.979,12.813,9.906l0.022,0.039L170.086,170.67h-42.111L342.969,45.514z M256.008,352.004
                                                                c0,5.896-4.771,10.667-10.667,10.667h-106.67c-5.896,0-10.667-4.771-10.667-10.667s4.771-10.667,10.667-10.667h106.67
                                                                C251.237,341.337,256.008,346.108,256.008,352.004z M288.009,426.67H138.671c-5.896,0-10.667-4.771-10.667-10.667
                                                                s4.771-10.667,10.667-10.667h149.338c5.896,0,10.667,4.771,10.667,10.667S293.905,426.67,288.009,426.67z M404.013,426.67
                                                                c-7,0-13.802-1.625-20.001-4.75c-6.198,3.125-13,4.75-20.001,4.75c-24.261,0-44.001-19.135-44.001-42.667
                                                                s19.74-42.667,44.001-42.667c7,0,13.803,1.625,20.001,4.75c6.198-3.125,13-4.75,20.001-4.75c24.261,0,44.001,19.135,44.001,42.667
                                                                S428.274,426.67,404.013,426.67z" />
                                        </g>
                                    </g>
                                </svg>
                            </div>
                        <? elseif ($arPaySystem['ID'] == 13) : ?>
                            <div class="checkout-categories-item-body-option__icon">
                                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512.001 512.001" style="enable-background:new 0 0 512.001 512.001;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <circle cx="255.001" cy="433.5" r="33"></circle>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M506.632,154.864C440.902,84.341,351.895,45.501,255.997,45.5C160.107,45.501,71.1,84.341,5.369,154.864
                                                                c-7.53,8.08-7.085,20.736,0.995,28.267c8.081,7.53,20.736,7.086,28.267-0.995C92.711,119.82,171.327,85.501,256.004,85.5
                                                                c84.67,0.001,163.286,34.32,221.366,96.636c3.939,4.226,9.28,6.364,14.635,6.364c4.883,0,9.778-1.778,13.632-5.369
                                                                C513.717,175.599,514.163,162.944,506.632,154.864z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M433.194,237.458c-48.587-48.954-111.516-75.913-177.196-75.911c-65.695,0.001-128.625,26.961-177.197,75.913
                                                                c-7.78,7.841-7.731,20.504,0.11,28.284c7.841,7.78,20.504,7.731,28.284-0.11c41.005-41.326,93.851-64.086,148.803-64.087
                                                                c54.938-0.002,107.784,22.759,148.804,64.089c3.91,3.939,9.052,5.911,14.196,5.911c5.092,0,10.188-1.934,14.09-5.805
                                                                C440.927,257.961,440.975,245.298,433.194,237.458z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M353.151,320.292c-26.02-25.779-63.317-41.792-97.339-41.792c-0.004,0-0.011,0-0.015,0h-1.441c-0.006,0-0.009,0-0.015,0
                                                                c-34.023,0-71.323,16.014-97.342,41.792c-7.846,7.774-7.905,20.437-0.131,28.284c3.911,3.947,9.059,5.924,14.208,5.924
                                                                c5.087,0,10.176-1.929,14.075-5.792c18.523-18.352,45.68-30.208,69.192-30.208c0.003,0,0.007,0,0.01,0h1.447
                                                                c0.004,0,0.005,0,0.009,0c23.509,0,50.668,11.857,69.189,30.208c7.846,7.773,20.511,7.717,28.284-0.132
                                                                C361.057,340.73,360.998,328.066,353.151,320.292z"></path>
                                        </g>
                                    </g>
                                </svg>
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="18px" height="25px" viewBox="-1 -4 20 12">
                                    <path fill-rule="evenodd" fill="rgb(0, 0, 0)" d="M11.000,6.000 L6.000,6.000 L6.000,11.000 L5.000,11.000 L5.000,6.000 L-0.000,6.000 L-0.000,5.000 L5.000,5.000 L5.000,-0.000 L6.000,-0.000 L6.000,5.000 L11.000,5.000 L11.000,6.000 Z"></path>
                                </svg>
                                <svg viewBox="0 -31 512 512" xmlns="http://www.w3.org/2000/svg">
                                    <path d="m497.09375 60.003906c-.03125 0-.0625-.003906-.09375-.003906h-136v-15c0-24.8125-20.1875-45-45-45h-120c-24.8125 0-45 20.1875-45 45v15h-136c-8.351562 0-15 6.84375-15 15v330c0 24.8125 20.1875 45 45 45h422c24.8125 0 45-20.1875 45-45v-329.683594c0-.019531 0-.039062 0-.058594-.574219-9.851562-6.632812-15.199218-14.90625-15.253906zm-316.09375-15.003906c0-8.269531 6.730469-15 15-15h120c8.269531 0 15 6.730469 15 15v15h-150zm295.1875 45-46.582031 139.742188c-2.042969 6.136718-7.761719 10.257812-14.226563 10.257812h-84.378906v-15c0-8.285156-6.714844-15-15-15h-120c-8.285156 0-15 6.714844-15 15v15h-84.378906c-6.464844 0-12.183594-4.121094-14.226563-10.257812l-46.582031-139.742188zm-175.1875 150v30h-90v-30zm181 165c0 8.269531-6.730469 15-15 15h-422c-8.269531 0-15-6.730469-15-15v-237.566406l23.933594 71.796875c6.132812 18.40625 23.289062 30.769531 42.6875 30.769531h84.378906v15c0 8.285156 6.714844 15 15 15h120c8.285156 0 15-6.714844 15-15v-15h84.378906c19.398438 0 36.554688-12.363281 42.6875-30.769531l23.933594-71.796875zm0 0"></path>
                                </svg>
                            </div>
                            <div class="checkout-categories-item-body-option__icon-hover">
                                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512.001 512.001" style="enable-background:new 0 0 512.001 512.001;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <circle cx="255.001" cy="433.5" r="33"></circle>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M506.632,154.864C440.902,84.341,351.895,45.501,255.997,45.5C160.107,45.501,71.1,84.341,5.369,154.864
                                                            c-7.53,8.08-7.085,20.736,0.995,28.267c8.081,7.53,20.736,7.086,28.267-0.995C92.711,119.82,171.327,85.501,256.004,85.5
                                                            c84.67,0.001,163.286,34.32,221.366,96.636c3.939,4.226,9.28,6.364,14.635,6.364c4.883,0,9.778-1.778,13.632-5.369
                                                            C513.717,175.599,514.163,162.944,506.632,154.864z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M433.194,237.458c-48.587-48.954-111.516-75.913-177.196-75.911c-65.695,0.001-128.625,26.961-177.197,75.913
                                                            c-7.78,7.841-7.731,20.504,0.11,28.284c7.841,7.78,20.504,7.731,28.284-0.11c41.005-41.326,93.851-64.086,148.803-64.087
                                                            c54.938-0.002,107.784,22.759,148.804,64.089c3.91,3.939,9.052,5.911,14.196,5.911c5.092,0,10.188-1.934,14.09-5.805
                                                            C440.927,257.961,440.975,245.298,433.194,237.458z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M353.151,320.292c-26.02-25.779-63.317-41.792-97.339-41.792c-0.004,0-0.011,0-0.015,0h-1.441c-0.006,0-0.009,0-0.015,0
                                                            c-34.023,0-71.323,16.014-97.342,41.792c-7.846,7.774-7.905,20.437-0.131,28.284c3.911,3.947,9.059,5.924,14.208,5.924
                                                            c5.087,0,10.176-1.929,14.075-5.792c18.523-18.352,45.68-30.208,69.192-30.208c0.003,0,0.007,0,0.01,0h1.447
                                                            c0.004,0,0.005,0,0.009,0c23.509,0,50.668,11.857,69.189,30.208c7.846,7.773,20.511,7.717,28.284-0.132
                                                            C361.057,340.73,360.998,328.066,353.151,320.292z"></path>
                                        </g>
                                    </g>
                                </svg>
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="18px" height="25px" viewBox="-1 -4 20 12">
                                    <path fill-rule="evenodd" fill="rgb(95, 98, 105)" d="M11.000,6.000 L6.000,6.000 L6.000,11.000 L5.000,11.000 L5.000,6.000 L-0.000,6.000 L-0.000,5.000 L5.000,5.000 L5.000,-0.000 L6.000,-0.000 L6.000,5.000 L11.000,5.000 L11.000,6.000 Z"></path>
                                </svg>
                                <svg viewBox="0 -31 512 512" xmlns="http://www.w3.org/2000/svg">
                                    <path d="m211 240h90v30h-90zm0 0"></path>
                                    <path d="m415.378906 270h-84.378906v15c0 8.289062-6.710938 15-15 15h-120c-8.289062 0-15-6.710938-15-15v-15h-84.378906c-19.394532 0-36.546875-12.363281-42.6875-30.761719l-53.933594-161.828125v327.589844c0 24.8125 20.1875 45 45 45h422c24.8125 0 45-20.1875 45-45v-327.578125l-53.9375 161.816406c-6.136719 18.398438-23.289062 30.761719-42.683594 30.761719zm0 0"></path>
                                    <path d="m316 0h-120c-24.8125 0-45 20.1875-45 45v15h-125.191406l56.574218 169.746094c2.050782 6.136718 7.777344 10.253906 14.238282 10.253906h84.378906v-15c0-8.289062 6.710938-15 15-15h120c8.289062 0 15 6.710938 15 15v15h84.378906c6.460938 0 12.1875-4.117188 14.238282-10.253906l56.578124-169.746094h-125.195312v-15c0-24.8125-20.1875-45-45-45zm-135 60v-15c0-8.277344 6.722656-15 15-15h120c8.277344 0 15 6.722656 15 15v15zm0 0"></path>
                                </svg>
                            </div>
                        <? elseif ($arPaySystem['ID'] == 14 || $arPaySystem['ID'] == 15) : ?>
                            <div class="checkout-categories-item-body-option__icon">
                                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512.001 512.001" style="enable-background:new 0 0 512.001 512.001;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <circle cx="255.001" cy="433.5" r="33"></circle>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M506.632,154.864C440.902,84.341,351.895,45.501,255.997,45.5C160.107,45.501,71.1,84.341,5.369,154.864
                                                                c-7.53,8.08-7.085,20.736,0.995,28.267c8.081,7.53,20.736,7.086,28.267-0.995C92.711,119.82,171.327,85.501,256.004,85.5
                                                                c84.67,0.001,163.286,34.32,221.366,96.636c3.939,4.226,9.28,6.364,14.635,6.364c4.883,0,9.778-1.778,13.632-5.369
                                                                C513.717,175.599,514.163,162.944,506.632,154.864z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M433.194,237.458c-48.587-48.954-111.516-75.913-177.196-75.911c-65.695,0.001-128.625,26.961-177.197,75.913
                                                                c-7.78,7.841-7.731,20.504,0.11,28.284c7.841,7.78,20.504,7.731,28.284-0.11c41.005-41.326,93.851-64.086,148.803-64.087
                                                                c54.938-0.002,107.784,22.759,148.804,64.089c3.91,3.939,9.052,5.911,14.196,5.911c5.092,0,10.188-1.934,14.09-5.805
                                                                C440.927,257.961,440.975,245.298,433.194,237.458z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M353.151,320.292c-26.02-25.779-63.317-41.792-97.339-41.792c-0.004,0-0.011,0-0.015,0h-1.441c-0.006,0-0.009,0-0.015,0
                                                                c-34.023,0-71.323,16.014-97.342,41.792c-7.846,7.774-7.905,20.437-0.131,28.284c3.911,3.947,9.059,5.924,14.208,5.924
                                                                c5.087,0,10.176-1.929,14.075-5.792c18.523-18.352,45.68-30.208,69.192-30.208c0.003,0,0.007,0,0.01,0h1.447
                                                                c0.004,0,0.005,0,0.009,0c23.509,0,50.668,11.857,69.189,30.208c7.846,7.773,20.511,7.717,28.284-0.132
                                                                C361.057,340.73,360.998,328.066,353.151,320.292z"></path>
                                        </g>
                                    </g>
                                </svg>
                            </div>
                            <div class="checkout-categories-item-body-option__icon-hover">
                                <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512.001 512.001" style="enable-background:new 0 0 512.001 512.001;" xml:space="preserve">
                                    <g>
                                        <g>
                                            <circle cx="255.001" cy="433.5" r="33"></circle>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M506.632,154.864C440.902,84.341,351.895,45.501,255.997,45.5C160.107,45.501,71.1,84.341,5.369,154.864
                                                            c-7.53,8.08-7.085,20.736,0.995,28.267c8.081,7.53,20.736,7.086,28.267-0.995C92.711,119.82,171.327,85.501,256.004,85.5
                                                            c84.67,0.001,163.286,34.32,221.366,96.636c3.939,4.226,9.28,6.364,14.635,6.364c4.883,0,9.778-1.778,13.632-5.369
                                                            C513.717,175.599,514.163,162.944,506.632,154.864z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M433.194,237.458c-48.587-48.954-111.516-75.913-177.196-75.911c-65.695,0.001-128.625,26.961-177.197,75.913
                                                            c-7.78,7.841-7.731,20.504,0.11,28.284c7.841,7.78,20.504,7.731,28.284-0.11c41.005-41.326,93.851-64.086,148.803-64.087
                                                            c54.938-0.002,107.784,22.759,148.804,64.089c3.91,3.939,9.052,5.911,14.196,5.911c5.092,0,10.188-1.934,14.09-5.805
                                                            C440.927,257.961,440.975,245.298,433.194,237.458z"></path>
                                        </g>
                                    </g>
                                    <g>
                                        <g>
                                            <path d="M353.151,320.292c-26.02-25.779-63.317-41.792-97.339-41.792c-0.004,0-0.011,0-0.015,0h-1.441c-0.006,0-0.009,0-0.015,0
                                                            c-34.023,0-71.323,16.014-97.342,41.792c-7.846,7.774-7.905,20.437-0.131,28.284c3.911,3.947,9.059,5.924,14.208,5.924
                                                            c5.087,0,10.176-1.929,14.075-5.792c18.523-18.352,45.68-30.208,69.192-30.208c0.003,0,0.007,0,0.01,0h1.447
                                                            c0.004,0,0.005,0,0.009,0c23.509,0,50.668,11.857,69.189,30.208c7.846,7.773,20.511,7.717,28.284-0.132
                                                            C361.057,340.73,360.998,328.066,353.151,320.292z"></path>
                                        </g>
                                    </g>
                                </svg>
                            </div>
                        <? endif; ?>
                        <div class="checkout-categories-item-body-option__text" <?= $disabled ? 'style="opacity:0.5"' : '' ?>>
                            <?= $arPaySystem["PSA_NAME"] ?>
                        </div>
                    </div>
                </label>


            <? } ?>
            <? foreach ($arResult["PAY_SYSTEM"] as $arPaySystem) :
            ?>
                <?
                if ($arPaySystem["ID"] == 16) :
                ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа). <br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.</span>

                <? elseif ($arPaySystem["ID"] == 17) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 18) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 20) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 21) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 22) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 23) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? elseif ($arPaySystem["ID"] == 19) : ?>
                    <span class="pay_description pay_<?= $arPaySystem["ID"]; ?>" style="font-size: 10px;">Итоговая сумма оплаты может измениться в <u>меньшую</u> сторону в процессе комплектации Вашего заказа.<br>
                        Разница между суммой первоначального списания денежных средств с вашей банковской карты и фактической суммой после комплектации заказа, или вся списанная сумма оплаты в случае полной отмены заказа - автоматически возвращается на расчетный счет карты клиента, с которой производилась оплата на сайте в сроки, установленные правилами Банка - эквайера клиента и используемой платежной системы сайта (от 3 до 30 календарных дней с момента выполнения заказа).<br>
                        При выборе типа оплаты Онлайн оплата - на ваш заказ не будет применена скидка "Комплименты" а так же "Кэшбэк."
                        <a href="https://петромост.рф/delivery-and-payment/" target="_blank">Подробнее о условиях доставки и оплаты</a>.
                    </span>
                <? endif; ?>
            <? endforeach;
            ?>
        </div>
        <div class="checkout-categories-item-bottom">
            <div class="checkout-categories-item-bottom-left">
                <a href="/" class="checkout-categories-item-bottom__btn js-checkout-back">&lt;&lt; Назад</a>
            </div>
            <div class="checkout-categories-item-bottom-right">
                <a href="/" class="checkout-categories-item-bottom__btn js-payment-next">Далее &gt;&gt;</a>
            </div>
        </div>
    </div>
    <div class="checkout-categories-item-body-details" id="payment_details"></div>
</div>